// TODO: Delete مستجد with id 167 [ Dublicated ]
let units = {
  "0": {
    name: "مستجد",
    afradId: "118"
  },
  "1": {
    name: "ك 14 ح ح",
    afradId: "47"
  },
  "2": {
    name: "ك 15 ح ح",
    afradId: "48"
  },
  "3": {
    name: "ك 102 ح ح",
    afradId: "52"
  },
  "4": {
    name: "ك 103 ح ح",
    afradId: "53"
  },
  "5": {
    name: "ك 104 ح ح",
    afradId: "54"
  },
  "6": {
    name: "ك 11 ح ح",
    afradId: "44"
  },
  "7": {
    name: "ك 12 ح ح",
    afradId: "45"
  },
  "8": {
    name: "ك 13 ح ح",
    afradId: "46"
  },
  "9": {
    name: "ك 16 ح ح",
    afradId: "49"
  },
  "10": {
    name: "ك 17 ح ح",
    afradId: "50"
  },
  "11": {
    name: "ك 105 ح ح",
    afradId: "55"
  },
  "12": {
    name: "ك 106 ح ح",
    afradId: "56"
  },
  "13": {
    name: "ك 107 ح ح",
    afradId: "57"
  },
  "14": {
    name: "ك 108 ح ح",
    afradId: "58"
  },
  "15": {
    name: "ك 109 ح ح",
    afradId: "59"
  },
  "16": {
    name: "ك 110 ح ح",
    afradId: "60"
  },
  "17": {
    name: "ك 111 ح ح",
    afradId: "61"
  },
  "18": {
    name: "ك 112 ح ح",
    afradId: "62"
  },
  "19": {
    name: "ك 113 ح ح",
    afradId: "63"
  },
  "20": {
    name: "ك 114 ح ح",
    afradId: "64"
  },
  "21": {
    name: "ك 115 ح ح",
    afradId: "65"
  },
  "22": {
    name: "س 1 رادار ساحلى",
    afradId: ""
  },
  "23": {
    name: "س 2 رادار ساحلى",
    afradId: ""
  },
  "24": {
    name: "س 3 رادار ساحلى",
    afradId: ""
  },
  "25": {
    name: "س 4 رادار ساحلى",
    afradId: ""
  },
  "26": {
    name: "س 5 رادار ساحلى",
    afradId: ""
  },
  "27": {
    name: "الفوج الاول",
    afradId: "4"
  },
  "29": {
    name: "قيادة قوات ح ح",
    afradId: ""
  },
  "30": {
    name: "سرية كشف عن مهربات جـ2ميد",
    afradId: "15"
  },
  "31": {
    name: "سرية كشف عن مهربات جـ3ميد",
    afradId: "16"
  },
  "32": {
    name: "مستودع المهمات",
    afradId: "72"
  },
  "33": {
    name: "غرفة الحبس",
    afradId: "31"
  },
  "34": {
    name: "مستودع الإشاره",
    afradId: "70"
  },
  "35": {
    name: "س 1 لنشات",
    afradId: "23"
  },
  "36": {
    name: "س 2 لنشات",
    afradId: "24"
  },
  "37": {
    name: "س 3 لنشات",
    afradId: "25"
  },
  "38": {
    name: "س 4 لنشات",
    afradId: "26"
  },
  "39": {
    name: "س 5 لنشات",
    afradId: "27"
  },
  "40": {
    name: "ورشة الإشاره",
    afradId: "112"
  },
  "41": {
    name: "مستودع المركبات",
    afradId: "71",
    insure: true
  },
  "42": {
    name: "ك 101 ح ح",
    afradId: "51"
  },
  "43": {
    name: "الورشه 1 مركبات",
    afradId: "114"
  },
  "44": {
    name: "الورشه 2 مركبات",
    afradId: "115"
  },
  "45": {
    name: "الورشه 3 مركبات",
    afradId: "116"
  },
  "46": {
    name: "الورشه 306 مركبات",
    afradId: "236",
    insure: true
  },
  "47": {
    name: "س 2 مقله",
    afradId: ""
  },
  "48": {
    name: "س 3 مقله",
    afradId: ""
  },
  "49": {
    name: "س 4 مقله",
    afradId: ""
  },
  "50": {
    name: "الورشه 207 مركبات",
    afradId: "117"
  },
  "51": {
    name: "ك 2 ح ح",
    afradId: "66"
  },
  "52": {
    name: "ك 3 ح ح",
    afradId: "67"
  },
  "53": {
    name: "ك 4 ح ح",
    afradId: "68"
  },
  "54": {
    name: "معهد حرس حدود",
    afradId: "73"
  },
  "57": {
    name: "الفوج 661 إشاره",
    afradId: "33"
  },
  "58": {
    name: "م تد ح ح",
    afradId: ""
  },
  "59": {
    name: "ك الدواب",
    afradId: "43"
  },
  "61": {
    name: "مكتب مخ القنطره شرق مستوى ج",
    afradId: "107"
  },
  "62": {
    name: "مكتب مخ نخل مستوى ج",
    afradId: "110"
  },
  "63": {
    name: "مكتب مخ القسيمه مستوى ج",
    afradId: "92"
  },
  "64": {
    name: "مكتب مخ النقب مستوى ج",
    afradId: "95"
  },
  "65": {
    name: "مكتب مخ الكونتيلا مستوى ج",
    afradId: "94"
  },
  "66": {
    name: "مكتب مخ ابورديس مستوى ج",
    afradId: "75"
  },
  "67": {
    name: "مكتب مخ عتاقه مستوى ج",
    afradId: "106"
  },
  "68": {
    name: "مكتب مخ ابوقير مستوى ج",
    afradId: "78"
  },
  "69": {
    name: "مكتب مخ رشيد مستوى ج",
    afradId: "102"
  },
  "70": {
    name: "مكتب مخ البرلس مستوى ج",
    afradId: "83"
  },
  "71": {
    name: "مكتب مخ السلوم مستوى ج",
    afradId: "85"
  },
  "72": {
    name: "مكتب مخ سيوه مستوى ج",
    afradId: "104"
  },
  "73": {
    name: "مكتب مخ راس الحكمه مستوى ج",
    afradId: "100"
  },
  "74": {
    name: "مكتب مخ ادفو مستوى ج",
    afradId: "79"
  },
  "75": {
    name: "مكتب مخ الواحات مستوى ج",
    afradId: "96"
  },
  "76": {
    name: "مكتب مخ ابوسمبل مستوى ج",
    afradId: "77"
  },
  "77": {
    name: "مكتب مخ القصير مستوى ج",
    afradId: "93"
  },
  "78": {
    name: "مكتب مخ برانيس مستوى ج",
    afradId: "97"
  },
  "79": {
    name: "مكتب مخ الشاذلى مستوى ج",
    afradId: "87"
  },
  "80": {
    name: "مكتب مخ السويس مستوى أ",
    afradId: "86"
  },
  "81": {
    name: "مكتب مخ دمياط مستوى أ",
    afradId: "99"
  },
  "82": {
    name: "مكتب مخ أسوان مستوى أ",
    afradId: "81"
  },
  "83": {
    name: "رئاسة مج مخ وأمن ح ح",
    afradId: "6"
  },
  "84": {
    name: "مكتب مخ الاسماعيليه مستوى ب",
    afradId: "80"
  },
  "85": {
    name: "مكتب مخ بورسعيد مستوى ب",
    afradId: "98"
  },
  "86": {
    name: "مكتب مخ العريش مستوى ب",
    afradId: "88"
  },
  "87": {
    name: "مكتب مخ رفح مستوى ب",
    afradId: "103"
  },
  "88": {
    name: "مكتب مخ ابوزنيمه مستوى ب",
    afradId: "76"
  },
  "89": {
    name: "مكتب مخ راس غارب مستوى ب",
    afradId: "101"
  },
  "90": {
    name: "مكتب مخ نويبع مستوى ب",
    afradId: "111"
  },
  "91": {
    name: "مكتب مخ الاسكندريه مستوى ب",
    afradId: "82"
  },
  "92": {
    name: "مكتب مخ العلمين مستوى ب",
    afradId: "89"
  },
  "93": {
    name: "مكتب مخ مطروح مستوى ب",
    afradId: "109"
  },
  "94": {
    name: "مكتب مخ شرق العلاقى مستوى ب",
    afradId: "105"
  },
  "95": {
    name: "مكتب مخ البويطى مستوى ب",
    afradId: "84"
  },
  "96": {
    name: "مكتب مخ العوينات مستوى ب",
    afradId: "90"
  },
  "97": {
    name: "مكتب مخ الغردقه مستوى ب",
    afradId: "91"
  },
  "98": {
    name: "مكتب مخ ابورماد مستوى ب",
    afradId: "74"
  },
  "99": {
    name: "مكتب مخ مرسى علم مستوى ب",
    afradId: "108"
  },
  "100": {
    name: "رئاسة مج مخ جـ 2 ح ح",
    afradId: "123",
    insure: true
  },
  "101": {
    name: "رئاسة مج مخ جـ 3 ح ح",
    afradId: "124",
    insure: true
  },
  "102": {
    name: "رئاسة مج مخ ح ح الشمالى",
    afradId: "125",
    insure: true
  },
  "103": {
    name: "رئاسة مج مخ ح ح الغربى",
    afradId: "126",
    insure: true
  },
  "104": {
    name: "رئاسة مج مخ ح ح الجنوبى",
    afradId: "127",
    insure: true
  },
  "105": {
    name: "رئاسة مج مخ ح ح البحر الأحمر",
    afradId: "128",
    insure: true
  },
  "106": {
    name: "قيادة ح ح الغربى",
    afradId: "38"
  },
  "107": {
    name: "قيادة ح ح الجنوبى",
    afradId: "36"
  },
  "108": {
    name: "قيادة ح ح الشمالى",
    afradId: "37"
  },
  "109": {
    name: "قيادة ح ح جـ2ميد",
    afradId: "35"
  },
  "110": {
    name: "قيادة ح ح جـ3ميد",
    afradId: "34"
  },
  "112": {
    name: "جناح حرس حدود (الكلية الحربية)",
    afradId: "5"
  },
  "114": {
    name: "قيادة شرق القناة لمكاقحة الإرهاب",
    afradId: "39"
  },
  "156": {
    name: "السرية الأولى رادار برى مقلة",
    afradId: "1"
  },
  "157": {
    name: "السرية الثانية رادار برى مقلة",
    afradId: "2"
  },
  "158": {
    name: "السرية الثالثة رادار برى مقلة",
    afradId: "3"
  },
  "159": {
    name: "سرية مهربات ج2 شرق التفريعة غرب",
    afradId: "13"
  },
  "160": {
    name: "سرية الكشف عن المهربات ج3 ميد شرم الشيخ",
    afradId: "14"
  },
  "161": {
    name: "سرية الكشف عن المهربات م غ ع السلوم",
    afradId: "17"
  },
  "163": {
    name: "قوات برية",
    afradId: ""
  },
  "164": {
    name: "ك 888 مكافحة ارهاب",
    afradId: "121"
  },
  "166": {
    name: "قيادة فوج بوابات الكشف عن المهربات",
    afradId: "122"
  },
  "167": {
    name: "مستجد",
    afradId: ""
  },
  "168": {
    name: "سرية تشغيل بوابة الكشف عن المهربات م ج ع (منفذ قسطل البري)",
    afradId: "131"
  },
  "169": {
    name: "سرية مهربات ج2 شرق التفريعة شرق",
    afradId: "130"
  },
  "170": {
    name: "فصيلة الكلاب لصالح القيادة الاستراتيجية",
    afradId: "222"
  },
  "171": {
    name: "الفوج 50 دفاع جوي",
    afradId: ""
  },
  "172": {
    name: "الفوج 55 دفاع جوي",
    afradId: ""
  },
  "173": {
    name: "الفوج 32 دفاع جوي",
    afradId: ""
  },
  "174": {
    name: "الفوج 112 دفاع جوي",
    afradId: ""
  },
  "175": {
    name: "الفوج 111 دفاع جوي",
    afradId: ""
  },
  "176": {
    name: "الفوج 48 دفاع جوي",
    afradId: ""
  },
  "177": {
    name: "الفوج 18 دفاع جوي",
    afradId: ""
  },
  "178": {
    name: "الفوج 114 دفاع جوي",
    afradId: ""
  },
  "179": {
    name: "الفوج 113 دفاع جوي",
    afradId: ""
  },
  "180": {
    name: "الفوج 2 ح ح",
    afradId: ""
  },
  "181": {
    name: "الفوج 4 ح ح",
    afradId: ""
  },
  "182": {
    name: "الفوج 6 ح ح",
    afradId: ""
  },
  "183": {
    name: "الفوج 8 ح ح",
    afradId: ""
  },
  "184": {
    name: "الفوج 10 ح ح",
    afradId: ""
  },
  "185": {
    name: "الفوج 13 ح ح",
    afradId: ""
  },
  "186": {
    name: "الفوج 14 ح ح",
    afradId: ""
  },
  "187": {
    name: "الفوج 16 ح ح",
    afradId: ""
  },
  "188": {
    name: "الفوج 20 ح ح",
    afradId: ""
  },
  "189": {
    name: "الفوج 22 ح ح",
    afradId: ""
  },
  "190": {
    name: "الفوج 24 ح ح",
    afradId: ""
  },
  "191": {
    name: "الفوج 26 ح ح",
    afradId: ""
  },
  "192": {
    name: "السرية الأولى هجانة",
    afradId: ""
  },
  "193": {
    name: "السرية الثانية هجانة",
    afradId: ""
  },
  "194": {
    name: "السرية الثالثة هجانة",
    afradId: ""
  },
  "195": {
    name: "السرية الرابعة هجانة",
    afradId: ""
  },
  "196": {
    name: "السرية الخامسة هجانة",
    afradId: ""
  },
  "197": {
    name: "السرية السادسة هجانة",
    afradId: ""
  },
  "198": {
    name: "السرية السابعة هجانة",
    afradId: ""
  },
  "199": {
    name: "فوج المقر البحري ح ح",
    afradId: ""
  },
  "200": {
    name: "قيادة البحرية",
    afradId: ""
  },
  "201": {
    name: "مجموعة لانشات البحر الأبيض",
    afradId: ""
  },
  "202": {
    name: "مجموعة لانشات البحر الأحمر",
    afradId: ""
  },
  "203": {
    name: "قطاع ح ح شمال سيناء",
    afradId: ""
  },
  "204": {
    name: "مركز البحث والإنقاذ",
    afradId: ""
  },
  "205": {
    name: "قيادة طريق مطروح",
    afradId: ""
  },
  "206": {
    name: "فصيلة النقل",
    afradId: ""
  },
  "207": {
    name: "قيادة السلوم البري",
    afradId: ""
  },
  "208": {
    name: "ورشة الصيانة البحرية ح ح",
    afradId: ""
  },
  "209": {
    name: "ميناء السلوم ح ح",
    afradId: ""
  },
  "210": {
    name: "السرية الثالثة حراسة ح ح",
    afradId: ""
  },
  "211": {
    name: "سرية النقل",
    afradId: ""
  },
  "212": {
    name: "سرية الإمداد والتموين ح ح",
    afradId: ""
  },
  "213": {
    name: "مركز تدريب الأخصائي",
    afradId: ""
  },
  "214": {
    name: "مركز تدريب الرياضي",
    afradId: ""
  },
  "215": {
    name: "الفوج 12 ح ح",
    afradId: ""
  },
  "216": {
    name: "مستودع المطبوعات والنشر",
    afradId: ""
  }
};
