// TODO: In Afrad, it has column 'Markaz Tadreb' => Take it
let forces = {
  "4": {
    name: "هيئة التنظيم والادارة",
    afrad: "1004"
  },
  "10": {
    name: "إدارة المشاة",
    afrad: "10"
  },
  "18": {
    name: "إدارة المركبات",
    afrad: null
  },
  "52": {
    name: "قيادة قوات حرس الحدود",
    afrad: "52"
  },
  "66": {
    name: "إدارة المركبات",
    afrad: "66"
  },
  "77": {
    name: "أجهزة قيادة",
    afrad: "77"
  },
  "88": {
    name: "ضابط احتياط",
    afrad: "88"
  },
  "100": {
    name: "إدارة الاشارة",
    afrad: "16"
  },
  "102": {
    name: "إدارة الأسلحة والذخيرة",
    afrad: "19"
  },
  "103": {
    name: "إدارة التعيينات",
    afrad: "24"
  },
  "104": {
    name: "إدارة المهمات",
    afrad: "26"
  },
  "105": {
    name: "إدارة الخدمات الطبية",
    afrad: "27"
  },
  "108": {
    name: "إدارة الحرب الإلكترونية",
    afrad: "17"
  },
  "109": {
    name: "إدارة المساحة العسكرية",
    afrad: "20"
  },
  "110": {
    name: "إدارة الشئون المعنوية",
    afrad: "21"
  },
  "111": {
    name: "إدارة الشرطة العسكرية",
    afrad: "22"
  },
  "112": {
    name: "إدارة الأشغال العسكرية",
    afrad: "29"
  },
  "113": {
    name: "قيادة قوات الدفاع الجوى",
    afrad: "51"
  },
  "114": {
    name: "جهاز الاستطلاع",
    afrad: "86"
  },
  "115": {
    name: "إدارة المدرعات",
    afrad: "11"
  },
  "116": {
    name: "إدارة المدفعية",
    afrad: "12"
  },
  "117": {
    name: "قيادة شرق القناه لمكافحة الارهاب",
    afrad: ""
  },
  "118": {
    name: "إدارة الخدمات البيطرية",
    afrad: "28"
  },
  "119": {
    name: "إدارة الوقود",
    afrad: "25"
  },
  "120": {
    name: "إدارة المهندسين العسكريين",
    afrad: "14"
  },
  "121": {
    name: "إدارة الحرب الكيميائية",
    afrad: "15"
  },
  "122": {
    // TODO: Delete this one [ Dublicated ]
    name: "إدارة الحرب الكيميائية",
    afrad: ""
  },
  "123": {
    name: "إدارة النقل",
    afrad: "23"
  },
  "124": {
    name: "قيادة القوات البحرية",
    afrad: "49"
  },
  "125": {
    name: "إدارة المطبوعات و النشر",
    afrad: "30"
  },
  "126": {
    name: "إدارة الإطفاء والإنقاذ للقوات المسلحة",
    afrad: "32"
  },
  "127": {
    name: "إدارة المياه",
    afrad: "31"
  },
  "128": {
    name: "الكليه الحربيه",
    afrad: "80"
  },
  "129": {
    name: "قياده الجيش الثالث الميدانى",
    afrad: ""
  },
  "130": {
    name: "قياده الجيش الثاني الميدانى",
    afrad: ""
  },
  "131": {
    name: "إدارة التجنيد والتعبئة",
    afrad: ""
  },
  "132": {
    name: "قياده المنطقه الجنوبيه العسكرية",
    afrad: ""
  },
  "133": {
    name: "إدارة التعليم والتدريب المهنى",
    afrad: "47"
  },
  "134": {
    name: "سلاح غير معرف,",
    afrad: "0"
  },
  "135": {
    name: "قياده المنطقه الشماليه العسكرية",
    afrad: ""
  }
};
